app/views/visitors/index.html.erb

    <p>This will be a landing page for visitors.</p>
    <p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM "users"