app/controllers/country_expenses_controller.rb

  def index
  	@countries = Country.all
  	@expenses = CountryExpense.all
  	@country_expenses = []
  	@countries.each do |country|
  	  food = country.country_expenses.where(expense_type:"Food")
---
SELECT "countries".* FROM "countries"
SELECT COUNT(*) FROM "countries"
SELECT "country_expenses".* FROM "country_expenses" WHERE "country_expenses"."country_id" = $1  [["country_id", 1]]
SELECT COUNT(*) FROM "country_expenses"
SELECT "country_expenses".* FROM "country_expenses" WHERE "country_expenses"."country_id" = $1 AND "country_expenses"."expense_type" = $2  [["country_id", 1], ["expense_type", "Food"]]