app/controllers/trip_route_controller.rb

  def show
    @trip = params[:trip_id]
    @trip_route = params[:id]
    @route = TripRoute.find params[:id]
---
SELECT  "trip_routes".* FROM "trip_routes" WHERE "trip_routes"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    respond_to do |format|
      format.json {
        @route = TripRoute.find params[:id]
        @new_route =params[:route_details]
        @route_array = @new_route.map do |position, details|
          details
        end
        @route.route_details = @route_array
        @route.save
---
SELECT  "trip_routes".* FROM "trip_routes" WHERE "trip_routes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "trip_routes" SET "route_details" = $1, "updated_at" = $2 WHERE "trip_routes"."id" = $3