app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    @user = User.find_for_facebook_oauth(request.env["omniauth.auth"])
    params = request.env["omniauth.params"]
    if @user.persisted?
      if params.empty? == false
        TripMembership.create(
          trip_id: params["trip_id"].to_i,
          user_id: @user.id
        )
---
INSERT INTO "users" ("provider", "uid", "email", "encrypted_password", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"